In [16]:
import pandas as pd
import numpy as np
import os 
from ast import literal_eval
import matplotlib.pyplot as plt

In [17]:
df_data= pd.read_csv("Resource/IMDb_movies.csv", low_memory=False)
df_data

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,None,Alexander Black,...,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,None,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,446,$ 45000,NaN,NaN,NaN,25.0,3.0
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2237,NaN,NaN,NaN,NaN,31.0,14.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,Le lion,2020,2020-01-29,Comedy,95,"France, Belgium",French,Ludovic Colbeau-Justin,...,"Dany Boon, Philippe Katerine, Anne Serra, Samu...",A psychiatric hospital patient pretends to be ...,5.3,398,NaN,NaN,$ 3507171,NaN,NaN,4.0
85851,tt9911196,De Beentjes van Sint-Hildegard,De Beentjes van Sint-Hildegard,2020,2020-02-13,"Comedy, Drama",103,Netherlands,"German, Dutch",Johan Nijenhuis,...,"Herman Finkers, Johanna ter Steege, Leonie ter...",A middle-aged veterinary surgeon believes his ...,7.7,724,NaN,NaN,$ 7299062,NaN,6.0,4.0
85852,tt9911774,Padmavyuhathile Abhimanyu,Padmavyuhathile Abhimanyu,2019,2019-03-08,Drama,130,India,Malayalam,Vineesh Aaradya,...,"Anoop Chandran, Indrans, Sona Nair, Simon Brit...",NaN,7.9,265,NaN,NaN,NaN,NaN,NaN,NaN
85853,tt9914286,Sokagin Çocuklari,Sokagin Çocuklari,2019,2019-03-15,"Drama, Family",98,Turkey,Turkish,Ahmet Faik Akinci,...,"Ahmet Faik Akinci, Belma Mamati, Metin Keçeci,...",NaN,6.4,194,NaN,NaN,$ 2833,NaN,NaN,NaN
85854,tt9914942,La vida sense la Sara Amat,La vida sense la Sara Amat,2019,2020-02-05,Drama,74,Spain,Catalan,Laura Jou,...,"Maria Morera Colomer, Biel Rossell Pelfort, Is...","Pep, a 13-year-old boy, is in love with a girl...",6.7,102,NaN,NaN,$ 59794,NaN,NaN,2.0

In [18]:
movies_cols= ["title","year","genre","country","language","usa_gross_income","worlwide_gross_income"]
df_movies= df_data[movies_cols].copy()
df_movies.head()

,title,year,genre,country,language,usa_gross_income,worlwide_gross_income
0,Miss Jerry,1894,Romance,USA,None,NaN,NaN
1,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,None,NaN,NaN
2,Den sorte drøm,1911,Drama,"Germany, Denmark",NaN,NaN,NaN
3,Cleopatra,1912,"Drama, History",USA,English,NaN,NaN
4,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,Italian,NaN,NaN

In [19]:
renamed={"usa_gross_income":"usaGrossIncome","worlwide_gross_income": "worldGrossIncome"}
df_movies=df_movies.rename(columns=renamed)
df_movies

,title,year,genre,country,language,usaGrossIncome,worldGrossIncome
0,Miss Jerry,1894,Romance,USA,None,NaN,NaN
1,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,None,NaN,NaN
2,Den sorte drøm,1911,Drama,"Germany, Denmark",NaN,NaN,NaN
3,Cleopatra,1912,"Drama, History",USA,English,NaN,NaN
4,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,Italian,NaN,NaN
...,...,...,...,...,...,...,...
85850,Le lion,2020,Comedy,"France, Belgium",French,NaN,$ 3507171
85851,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,"German, Dutch",NaN,$ 7299062
85852,Padmavyuhathile Abhimanyu,2019,Drama,India,Malayalam,NaN,NaN
85853,Sokagin Çocuklari,2019,"Drama, Family",Turkey,Turkish,NaN,$ 2833
85854,La vida sense la Sara Amat,2019,Drama,Spain,Catalan,NaN,$ 59794

In [20]:
df_movies.dtypes

title               object
year                object
genre               object
country             object
language            object
usaGrossIncome      object
worldGrossIncome    object
dtype: object

In [37]:
df_movies["usaGrossIncome"]=pd.to_numeric(df_movies["usaGrossIncome"].replace([np.inf,-np.inf], np.nan).dropna(), downcast="integer", errors="coerce")
df_movies["worldGrossIncome"]=pd.to_numeric(df_movies["worldGrossIncome"].replace([np.inf,-np.inf], np.nan).dropna(), downcast="integer", errors="coerce")

In [38]:
df_movies.dtypes

title                       object
year                datetime64[ns]
genre                       object
country                     object
language                    object
usaGrossIncome             float64
worldGrossIncome           float64
dtype: object

In [39]:
df_movies

,title,year,genre,country,language,usaGrossIncome,worldGrossIncome
0,Miss Jerry,1894-01-01,Romance,USA,None,NaN,NaN
1,The Story of the Kelly Gang,1906-01-01,"Biography, Crime, Drama",Australia,None,NaN,NaN
2,Den sorte drøm,1911-01-01,Drama,"Germany, Denmark",NaN,NaN,NaN
3,Cleopatra,1912-01-01,"Drama, History",USA,English,NaN,NaN
4,L'Inferno,1911-01-01,"Adventure, Drama, Fantasy",Italy,Italian,NaN,NaN
...,...,...,...,...,...,...,...
85850,Le lion,2020-01-01,Comedy,"France, Belgium",French,NaN,NaN
85851,De Beentjes van Sint-Hildegard,2020-01-01,"Comedy, Drama",Netherlands,"German, Dutch",NaN,NaN
85852,Padmavyuhathile Abhimanyu,2019-01-01,Drama,India,Malayalam,NaN,NaN
85853,Sokagin Çocuklari,2019-01-01,"Drama, Family",Turkey,Turkish,NaN,NaN
85854,La vida sense la Sara Amat,2019-01-01,Drama,Spain,Catalan,NaN,NaN

In [41]:
df_movies["usaGrossIncome"]=df_movies["usaGrossIncome"].fillna(0)
df_movies["worldGrossIncome"]=df_movies["worldGrossIncome"].fillna(0)
df_movies

,title,year,genre,country,language,usaGrossIncome,worldGrossIncome
0,Miss Jerry,1894-01-01,Romance,USA,None,0.0,0.0
1,The Story of the Kelly Gang,1906-01-01,"Biography, Crime, Drama",Australia,None,0.0,0.0
2,Den sorte drøm,1911-01-01,Drama,"Germany, Denmark",NaN,0.0,0.0
3,Cleopatra,1912-01-01,"Drama, History",USA,English,0.0,0.0
4,L'Inferno,1911-01-01,"Adventure, Drama, Fantasy",Italy,Italian,0.0,0.0
...,...,...,...,...,...,...,...
85850,Le lion,2020-01-01,Comedy,"France, Belgium",French,0.0,0.0
85851,De Beentjes van Sint-Hildegard,2020-01-01,"Comedy, Drama",Netherlands,"German, Dutch",0.0,0.0
85852,Padmavyuhathile Abhimanyu,2019-01-01,Drama,India,Malayalam,0.0,0.0
85853,Sokagin Çocuklari,2019-01-01,"Drama, Family",Turkey,Turkish,0.0,0.0
85854,La vida sense la Sara Amat,2019-01-01,Drama,Spain,Catalan,0.0,0.0